AoA_10/0/thickness
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      thickness;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    externalWalls
    {
        type            fixedValue;
        value           uniform 0;
    }
    frontAndBack
    {
        type            fixedValue;
        value           uniform 0;
    }
    avion
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
119988
(
0
0
0
0
0
0
0
0
...
)
;
    }
}


// ************************************************************************* //
